Repository: pypi-data/pypi-mirror-319
Catalog: packages/tikka/tikka-0.13.0-py3-none-any.whl/tikka/locales/*/LC_MESSAGES/application.po
Languages: fr_fr

source: Units
fr_fr: Unités

source: UD {symbol}
fr_fr: DU {symbol}

source: Universal Dividend
fr_fr: Dividende Universel

source: Import account
fr_fr: Importer un compte

source: V1 address
fr_fr: Adresse V1

source: Secret ID
fr_fr: ID secret

source: Password
fr_fr: Mot de passe

source: Name
fr_fr: Nom

source: Address
fr_fr: Adresse

source: Show
fr_fr: Afficher

source: Change
fr_fr: Changer

source: Add address from QRCode
fr_fr: Ajouter adresse depuis un QRCode

source: Add category
fr_fr: Ajouter une catégorie

source: Restore V1 wallet from file
fr_fr: Restaurer le trousseau V1 à partir d'un fichier

source: Browse files...
fr_fr: Parcourir le disque...

source: File Password
fr_fr: Mot de passe fichier

source: Path
fr_fr: Chemin

source: Wallet will be locked with the current password
fr_fr: Le trousseau sera verrouillé avec le mot de passe actuel

source: Save wallet
fr_fr: Sauvegarder le trousseau

source: File format
fr_fr: Format de fichier

source: Rename account
fr_fr: Renommer le compte

source: Tikka will create your wallet from the mnemonic, and will store it protected by a password.
fr_fr: Tikka va créer votre trousseau à partir du mnémonique, et le stocker protégé par un mot de passe.

source: Mnemonic
fr_fr: Mnémonique

source: 12 words separated by spaces
fr_fr: 12 mots séparés par des espaces

source: Mnemonic language
fr_fr: Langue mnémonique

source: derivation path (ex. //0 or //2)
fr_fr: chemin de dérivation (ex. //0 ou //2)

source: Derivation
fr_fr: Dérivation

source: Restore wallet
fr_fr: Restaurer le trousseau

source: Use your mnemonic phrase to restore wallet
fr_fr: Utilisez votre phrase mnémonique pour restaurer le trousseau

source: Import Vault by mnemonic
fr_fr: Import Coffre par mnémonique

source: Tikka will create your vault from the mnemonic, and will store each account protected by the same password.
fr_fr: Tikka va créer votre coffre à partir du mnémonique, et stocker chaque compte protégé par le même mot de passe.

source: Welcome
fr_fr: Bienvenue

source: Welcome in Tikka, the Duniter V2 client for the desktop. To get started, you can import an existing account or create a new one.*
fr_fr: Bienvenue dans Tikka, le client Duniter V2 pour ordinateur de bureau. Pour commencer, vous pouvez importer un compte existant ou en créer un nouveau.*

source: Import existing account
fr_fr: Importer un compte existant

source: Create a new account
fr_fr: Créer un nouveau compte

source: * If you are a V1 user, without a V2 account, you need to create a new V2 account before importing your V1 account into it.
fr_fr: * Si vous êtes un utilisateur de la V1, sans un compte V2, vous devez créer un nouveau compte V2 avant d'importer votre compte V1.

source: Continue
fr_fr: Continuer

source: Language
fr_fr: Langue

source: Restart application to apply language change
fr_fr: Relancer l'application pour appliquer le changement

source: Currency
fr_fr: Monnaie

source: Connect randomly to a node at start
fr_fr: Se connecter aléatoirement au lancement

source: Transfer
fr_fr: Virement

source: Amount
fr_fr: Montant

source: Send
fr_fr: Envoyer

source: Name or address
fr_fr: Nom ou adresse

source: Recipient
fr_fr: Destinataire

source: Fees
fr_fr: Frais

source: Sender
fr_fr: Émetteur

source: Create account
fr_fr: Créer un compte

source: I have saved my mnemonic phrase in a safety place
fr_fr: J'ai sauvegardé ma phrase mnémonique dans un endroit sûr

source: Acco&unts
fr_fr: &Comptes

source: &Help
fr_fr: &Aide

source: Net&work
fr_fr: &Réseau

source: &V1 accounts
fr_fr: Comptes &V1

source: Advanc&ed
fr_fr: &Avancé

source: Vau&lts
fr_fr: C&offres

source: Account tr&ee
fr_fr: Arbr&e des comptes

source: Account tree
fr_fr: Arbre des comptes

source: A&dd an address
fr_fr: Ajouter une a&dresse

source: Add an address
fr_fr: Ajouter une adresse

source: &Create an account
fr_fr: &Créer un compte

source: Import &file
fr_fr: Importer un &fichier

source: Import file
fr_fr: Importer un fichier

source: &Quit
fr_fr: &Quitter

source: Ğ1 &licence
fr_fr: &Licence Ğ1

source: &About
fr_fr: &A propos

source: &Connection
fr_fr: &Connexion

source: Connection
fr_fr: Connexion

source: &Import account
fr_fr: &Importer un compte

source: Import &account
fr_fr: Importer un &compte

source: C&urrency
fr_fr: &Monnaie

source: &Add server
fr_fr: &Ajouter un serveur

source: Add server
fr_fr: Ajouter un serveur

source: &Servers
fr_fr: &Serveurs

source: Account ta&ble
fr_fr: Ta&bleau des comptes

source: &Welcome
fr_fr: &Bienvenue

source: &Transfer
fr_fr: &Virement

source: &Import V1 in V2 wizard
fr_fr: Assistant d'&import V1 en V2

source: Import V1 in V2 wizard
fr_fr: &Assistant d'import V1 en V2

source: &Scan a QRCode
fr_fr: &Scanner un QRCode

source: &Smith
fr_fr: &Forgeron

source: &Technical Committee
fr_fr: Comité &Technique

source: &Import by Mnemonic
fr_fr: &Import par Mnémonique

source: Import by Address
fr_fr: Import par adresse

source: Unlock account
fr_fr: Déverrouiller le compte

source: Create derived account
fr_fr: Créer un compte dérivé

source: Root
fr_fr: Racine

source: Import a V1 file
fr_fr: Importer un fichier V1

source: About
fr_fr: A propos

source: A free software desktop client for Duniter. Manage your Ğ1 accounts securely and easily!
fr_fr: Un client de bureau en logiciel libre pour Duniter. Gérez vos comptes Ǧ1 facilement et en toute sécurité !

source: Author
fr_fr: Auteur

source: Author list
fr_fr: Liste des auteurs

source: V1 wallet restore
fr_fr: Restaurer le trousseau V1

source: Entry point
fr_fr: Point d'entrée

source: Software
fr_fr: Logiciel

source: Block
fr_fr: Bloc

source: Wizard to import V1 account in V2 account
fr_fr: Assistant d'import de compte V1 dans un compte V2

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Ubuntu'; font-size:11pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">This wizard will help you to import your V1 account into a V2 account.</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><br /></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">The V2 account to receive the identity and/or currency of the V1 account must exist in Tikka.</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><br /></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">If not, exit this wizard and create a V2 account by carefully and secretly writing down the restoration code (mnemonic).</p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><br /></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600; font-style:italic;">V1 account: </span><span style=" font-style:italic;">A V1 account is an Ğ1 account generated by a secret ID and a password (with Cesium V1).</span></p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px; font-style:italic;"><br /></p> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600; font-style:italic;">V2 Account:</span><span style=" font-style:italic;"> A V2 account is an account generated by a twelve-word restoration code (also called mnemonic).</span></p> <p style="-qt-paragraph-type:empty; margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><br /></p></body></html>
fr_fr: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Ubuntu'; font-size:11pt; font-weight:400; font-style:normal;"> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Cet assistant vous aidera à importer votre compte V1 dans un compte V2.</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Le compte V2 qui recevra l'identité et/ou la monnaie du compte V1 doit exister dans Tikka.</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Si ce n'est pas le cas, quittez cet assistant et créez un compte V2 en notant soigneusement et secrètement le code de restauration (mnémonique).</p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600; font-style:italic;">Compte V1 :</span><span style=" font-style:italic;"> Un compte V1 est un compte Ğ1 généré par un identifiant secret et un mot de passe (avec Cesium V1).</span></p> <p style=" margin-top:12px; margin-bottom:12px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;"><span style=" font-weight:600; font-style:italic;">Compte V2 :</span><span style=" font-style:italic;"> Un compte V2 est un compte généré par un code de restauration de douze mots (également appelé mnémonique).</span></p></body></html>

source: Please enter the credentials of the V1 source account.
fr_fr: Veuillez entrer les identifiants secrets du compte source V1.

source: V1 Source Account
fr_fr: Compte Source V1

source: V1 Address
fr_fr: Adresse V1

source: Identity
fr_fr: Identité

source: Balance
fr_fr: Solde

source: Select a V2 destination account already created and confirm with the restoration mnemonic.
fr_fr: Sélectionnez un compte V2 de destination déjà créé et confirmez avec le mnémonique de restauration.

source: V2 Destination Account
fr_fr: Compte V2 de Destination

source: Root account
fr_fr: Compte racine

source: Click on the import button and wait for the status message. The V1 source account will be deleted from the blockchain on success.
fr_fr: Cliquez sur le bouton d'importation et attendez le message du résultat. Le compte source V1 sera supprimé de la blockchain en cas de succès.

source: Import
fr_fr: Importer

source: Network nodes
fr_fr: Nœuds du réseau

source: Currency parameters
fr_fr: Paramètres de la monnaie

source: Refresh
fr_fr: Actualiser

source: Symbol
fr_fr: Symbole

source: Monetary Mass
fr_fr: Masse Monétaire

source: Members
fr_fr: Membres

source: Expected Block duration
fr_fr: Durée attendue d'un bloc

source: Expected Epoch duration
fr_fr: Durée attendue d'une Epoch

source: Accounts
fr_fr: Comptes

source: Account table
fr_fr: Tableau des comptes

source: Filters
fr_fr: Filtres

source: Category
fr_fr: Catégorie

source: Wallet
fr_fr: Trousseau

source: Proposal Hash
fr_fr: Hash Proposition

source: Function
fr_fr: Fonction

source: Voting
fr_fr: Vote

source: Threshold
fr_fr: Seuil

source: End
fr_fr: Fin

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Account
fr_fr: Compte

source: Transfer to
fr_fr: Virement vers

source: None
fr_fr: Aucune

source: Smith
fr_fr: Forgeron

source: Select an account with a validated identity and a wallet
fr_fr: Sélectionnez un compte avec une identité validée et un trousseau

source: Go online
fr_fr: Mettre en ligne

source: Smith Membership
fr_fr: Adhésion Forgeron

source: Refresh nodes from network
fr_fr: Actualiser les nœuds du réseau

source: Authority
fr_fr: Autorité

source: Go offline
fr_fr: Mettre hors ligne

source: Validator node
fr_fr: Nœud validateur

source: Session keys
fr_fr: Clefs de session

source: Rotate keys
fr_fr: Rotation clefs

source: Publish keys
fr_fr: Publier les clefs

source: Accept invitation
fr_fr: Accepter invitation

source: Invite Member
fr_fr: Inviter Membre

source: Certify
fr_fr: Certifier

source: Certifiers
fr_fr: Certificateurs

source: Certified
fr_fr: Certifiés

source: Ğ1 licence
fr_fr: Licence Ğ1

source: Server
fr_fr: Serveur

source: Connection to entry point
fr_fr: Connexion au point d'entrée

source: Connect
fr_fr: Connecter

source: Unsafe API exposed
fr_fr: Unsafe API exposée

source: Voting account
fr_fr: Compte Votant

source: Proposals
fr_fr: Propositions

source: English
fr_fr: Anglais

source: French
fr_fr: Français

source: Chinese simplified
fr_fr: Chinois simplifié

source: Chinese traditional
fr_fr: Chinois traditionnel

source: Italian
fr_fr: Italien

source: Japanese
fr_fr: Japonais

source: Korean
fr_fr: Koréen

source: Spanish
fr_fr: Espagnol

source: Mnemonic or language not valid!
fr_fr: Mnémonique ou langue non valide !

source: Hide
fr_fr: Masquer

source: Derivation is not valid!
fr_fr: Dérivation non valide !

source: Account already exists!
fr_fr: Le compte existe déjà !

source: Language not detected
fr_fr: Langue non détectée

source: Mnemonic not valid!
fr_fr: Mnémonique non valide !

source: Connection status. Click to open connection tab.
fr_fr: Statut de la connexion. Cliquez pour ouvrir l'onglet connexion.

source: Servers
fr_fr: Serveurs

source: Technical Committee
fr_fr: Comité Technique

source: Unable to decrypt file!
fr_fr: Impossible de déchiffrer le fichier !

source: File password is not valid!
fr_fr: Mot de passe du fichier non valide !

source: File address is not the account address!
fr_fr: L'adresse du fichier n'est pas l'adresse du compte !

source: Choose wallet file
fr_fr: Choisir le fichier trousseau

source: Change wallet password?
fr_fr: Changer le mot de passe du trousseau ?

source: A wallet already exists for this account. Change password for {address} wallet?
fr_fr: Un trousseau existe déjà pour ce compte. Changer le mot de passe du trousseau {address} ?

source: Account address is not valid!
fr_fr: Adresse de compte non valide !

source: Mnemonic address is not the account address!
fr_fr: L'adresse du mnémonique n'est pas l'adresse du compte !

source: Transfer/payment would kill account
fr_fr: Le Virement/Paiement supprimerait le compte

source: Balance too low to send value
fr_fr: Solde trop bas pour ce montant

source: Invalid address! Please check it again.
fr_fr: Adresse invalide ! Veuillez la vérifier.

source: Unknown!
fr_fr: Inconnu !

source: Account balance unknown! Send only one unit and make sure the owner can get it
fr_fr: Solde du compte inconnu ! Envoyer une seule unité et assurez-vous que le propriétaire peut la récupérer

source: Invalid character in comment
fr_fr: Caractère invalide dans le commentaire

source: Transfer failed. Please check logs to understand why
fr_fr: Échec du virement. Veuillez vérifier les logs pour comprendre la raison

source: Transfer done
fr_fr: Virement effectué

source: Error generating account wallet!
fr_fr: Erreur sur la génération du trousseau !

source: Impossible to connect
fr_fr: Connexion impossible

source: Mnemonic address is not the root account address!
fr_fr: L'adresse du mnémonique n'est pas l'adresse du compte racine !

source: QRCode Scanner canceled
fr_fr: Scanner QRCode annulé

source: No camera available
fr_fr: Aucune caméra disponible

source: Added from a QRCode
fr_fr: Ajouté depuis un QRCode

source: Generated address is not the account address!
fr_fr: L'adresse générée n'est pas l'adresse du compte !

source: Unconfirmed
fr_fr: Non Confirmée

source: Unvalidated
fr_fr: Non Validée

source: Member
fr_fr: Membre

source: Not member
fr_fr: Non Membre

source: Revoked
fr_fr: Révoqué

source: This account does not exists
fr_fr: Ce compte n'existe pas

source: Account is valid
fr_fr: Le compte est valide

source: Account has already an identity!
fr_fr: Le compte a déjà une identité !

source: Account imported successfully!
fr_fr: Compte importé avec succès !

source: Error importing money!
fr_fr: Erreur d'importation de la monnaie !

source: Error importing identity!
fr_fr: Erreur d'importation de l'identité !

source: Password is not valid!
fr_fr: Mot de passe non valide !

source: Account is unlocked
fr_fr: Compte déverrouillé

source: Invited
fr_fr: Invité

source: Pending
fr_fr: En cours

source: Excluded
fr_fr: Exclus

source: Incoming...
fr_fr: Entrante...

source: Online
fr_fr: En ligne

source: Outgoing...
fr_fr: Sortante...

source: Close Tab
fr_fr: Fermer l'Onglet

source: Close All Tabs
fr_fr: Fermer Tous les Onglets

source: Close Other Tabs
fr_fr: Fermer les Autres Onglets

source: Close Tabs to the Left
fr_fr: Fermer les Onglets à Gauche

source: Close Tabs to the Right
fr_fr: Fermer les Onglets à Droite

source: Reopen Closed Tab
fr_fr: Ré-ouvrir le dernier Onglet Fermé

source: Copy peer ID to clipboard
fr_fr: Copier le Peer ID dans le presse-papier

source: Forget server
fr_fr: Oublier le serveur

source: Forget server {}?
fr_fr: Oublier le serveur {} ?

source: No filter
fr_fr: Pas de filtre

source: No technical committee account selected
fr_fr: Aucun compte du Comité Technique sélectionné

source: Unknown account
fr_fr: Compte inconnu

source: Reconnect
fr_fr: Reconnecter

source: Rename
fr_fr: Renommer

source: Add sub-category
fr_fr: Ajouter une sous-catégorie

source: Delete category
fr_fr: Supprimer la catégorie

source: Category content will be moved to parent. Do you really want to delete "{name}"?
fr_fr: Le contenu de la catégorie sera déplacé dans son parent. Voulez-vous vraiment supprimer "{name}" ?

source: Transfer from
fr_fr: Virement depuis

source: Copy address to clipboard
fr_fr: Copier l'adresse dans le presse-papier

source: Unlock account access
fr_fr: Déverrouiller l'accès au compte

source: Lock account access
fr_fr: Verrouiller l'accès au compte

source: Forget the wallet
fr_fr: Oublier le trousseau

source: Store the wallet
fr_fr: Stocker le trousseau

source: Password forgotten / change
fr_fr: Mot de passe oublié / Changer

source: Forget account
fr_fr: Oublier le compte

source: Forget wallet
fr_fr: Oublier le trousseau

source: Forget wallet for account {address}?
fr_fr: Oublier le trousseau du compte {address} ?

source: Forget account {address} (and derived accounts if any)?
fr_fr: Oublier le compte {address} (et ses comptes dérivés) ?

source: Exposed
fr_fr: Exposée

source: Balance ({symbol})
fr_fr: Solde {symbol}
